Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: ཁྱོ་དང་བུ་དང་བུ་མོ་དང་བྲལ་བའི་སྡུག་བསྔལ་གྱིས་ཉམ་ཐག་ནས་དབུགས་བརྫངས་པས་སྒྲ་ངར་ངར་པོར་འགགས་བཞིན་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་གིས་ཚེ་རབས་སྔ་མ་ལ། །ཅི་འདྲ་བ་ཡི་ལས་ངན་བྱས།
en: Overwhelmed by the pain of separation from her husband, son, and daughter, she said, her voice interrupted by gasping: “ ‘What evil karma did I create In my previous lives, Whereby I weep in a solitary forest

source: །དེ་ནས་བ་བེའུ་ཤི་བ་བཞིན། །སྐྱེ་བོ་མེད་པའི་ནགས་ན་ངུ་།
en: Like a cow whose calves have died?’

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྲམ་ཟེའི་ཆ་བྱད་མི་སྣང་བར་བྱས་ཏེ། རང་བཞིན་གྱི་ཆ་བྱད་དུ་གནས་ནས་རྒྱགས་སྦྱིན་མ་ལ་སྨྲས་པ།
en: “Then Śakra, Lord of the Gods, extinguished his form as a brahmin, took his own form, and said to Mādrī:

source: སྐལ་བཟངས་བདག་ནི་བྲམ་ཟེ་མ་ཡིན་མི་ཡང་མ་ཡིན་གྱི།
en: “ ‘Fortunate one, I am not a brahmin or human;

source: །བདག་ནི་ལྷ་ཡི་དབང་པོ་བརྒྱ་བྱིན་ལྷ་མིན་འཇོམས་བྱེད་དེ།
en: I am Śakra, Lord of the Gods, destroyer of the asuras.

source: །ཁྱོད་ཀྱི་འདུལ་བ་མཆོག་ཏུ་གྱུར་པ་འདི་ཡིས་བདག་མགུ་ཡིས།
en: This eminent conduct of yours pleased me.

source: །བདག་ལས་དམ་པ་གང་ཞིག་འདོད་པ་དེ་འདིར་སྨྲ་བར་གྱིས།
en: So, ask for anything you most want from me here.’

source: །དེ་ནས་དེའི་ཚིག་གིས་རྒྱགས་སྦྱིན་མ་ཡིད་བདེ་བ་སྐྱེས་ནས་བརྒྱ་བྱིན་ལ་ཕྱག་འཚལ་ནས་སྨྲས་པ།
en: Having rejoiced at these words, Mādrī bowed to Śakra and said:

source: སྤྱན་སྟོང་ལྡན་པ་བདག་གི་བུ།
en: “ ‘O Thousand-Eyed, May the king of the Thirty-Three Gods

source: །བྲན་གྱུར་པ་ལས་ཐར་མཛད་ཅིང་།
en: Liberate my children from servitude

source: །མེས་པོའི་དྲུང་དུ་ཕྱིན་པར་ཡང་། །སུམ་བཅུ་རྩ་གསུམ་བདག་པོས་མཛོད།
en: And let them reach their grandfather.’

source: །དེ་སྐད་ཅེས་སྨྲས་ནས་ཡང་དབང་པོ་ཆེན་པོ་བསྟི་གནས་སུ་ཞུགས་ནས་བྱང་ཆུབ་སེམས་དཔའི་དྲུང་དུ་སོང་སྟེ་རྒྱགས་སྦྱིན་མ་ལག་པ་གཡོན་པ་ནས་བཟུང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: “Having had this asked of him, the great Indra entered the hermitage, held Mādrī with his left hand, went to the bodhisattva, and said to him:

source: བདག་གིས་ཁྱོད་ལ་རྒྱགས་སྦྱིན་འདི།
en: “ ‘I give you back this Mādrī

source: །གཡོག་གི་ཕྱིར་ནི་སྦྱིན་པར་བྱས།
en: To attend to you.

source: །ཁྱོད་ཀྱིས་སུ་ལའང་མ་སྦྱིན་ཅིག །བཞག་པ་བྱིན་ན་སྨད་པར་འགྱུར།
en: You should not give her to anyone. You will be scolded if you give away one entrusted to you.’

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྲམ་ཟེ་ཁྱེའུ་དང་བུ་མོ་ཁྱེར་བ་དེ་ཇི་ལྟར་གྲོང་ཁྱེར་གཞན་ཞིག་ཡིན་ནོ་སྙམ་ནས་གྲོང་ཁྱེར་དེ་ཉིད་དུ་སོང་སྟེ་བུས་པ་གཞོན་ནུ་དེ་དག་བཙོང་བར་བརྩམས་པ་དེ་ལྟ་བུར་རྨོངས་པར་བྱས་སོ།
en: “Thereupon Śakra, Lord of the Gods, drove that brahmin who had taken away the son and daughter insane so that he went to that very city, thinking that it was some other city, and offered to sell the young children.

source: །ཇི་ཙམ་ན་བློན་པོ་རྣམས་ཀྱིས་མཐོང་ནས་རྒྱལ་པོ་ལ་སྨྲས་པ། ལྷ།
en: The ministers saw this and said to the king, ‘Your Majesty,

source: ཁྱོད་ཀྱི་དཔོན་པོ་ནག་པོ་དང་། །དྲ་བ་ཅན་དང་དེ་གཉིས་ནི།
en: “ ‘Your two grandchildren, Kṛṣṇa and Jālinī,

source: །བྲམ་ཟེ་ཤིན་ཏུ་མ་རུངས་པས།
en: Are being sold by a wicked brahmin

source: །གྲོང་ཁྱེར་མཆོག་འདིར་འཚོང་ཞིང་མཆིས།
en: In this most excellent city.’

source: །དེ་སྐད་ཐོས་ནས་རྒྱལ་པོ་དེ་སེམས་མི་དགའ་ནས་སྨྲས་པ། གཞོན་ནུ་གཉིས་མྱུར་དུ་སྟོན་ཅིག །བློན་པོ་རྣམས་ཀྱིས་སྐད་ཕྱུང་བ་དང་གྲོང་ཁྱེར་པ་རྣམས་མྱུར་དུ་རྒྱལ་པོའི་མདུན་དུ་ཉེ་བར་ལྷགས་སོ།
en: “When he heard this, the king became upset and said, ‘Quickly, show me the two children.’ “The ministers gave a cry, and the citizens hurried to the king. Then a minister took the children to the king.

source: །ཇི་ཙམ་ན་བློན་པོ་གཞན་ཞིག་གིས་རྒྱལ་པོའི་དྲུང་དུ་ཁྲིད་པ་དང་། མིའི་དབང་པོ་མངོན་ཕྱོགས་ཁྲིད་པའི་ཚ་བོ་གོས་མེད་ཅིང་།
en: “When he saw his grandchildren brought before him without any clothes,

source: །ལུས་རྦེག་དྲི་མ་ཅན་གྱི་ལུས་དེ་དེ་ཡིས་མཐོང་ནས་ནི།
en: Their bodies covered with dirt, the master of the people

source: །མོད་ལ་སེང་གེའི་ཁྲི་ལས་ས་ཡི་སྟེང་དུ་ལྷུང་གྱུར་ཏེ།
en: Suddenly fell to the ground from the throne,

source: །ཕོ་བྲང་འཁོར་མི་བློན་ཚོགས་བུད་མེད་དག་ཀྱང་ངུ་བར་གྱུར།
en: And citizens, ministers, and women wept, too.

source: །དེ་ནས་རྒྱལ་པོས་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: “Thereupon the king said to the ministers: “ ‘Somebody, call him here,

source: གང་ཞིག་ནགས་ན་གནས་ན་ཡང་། །སྦྱིན་ལ་མངོན་པར་དགའ་བའི་ཡིད།
en: Whose mind is pleased with giving even while living in the forest

source: །མིག་བཟངས་དེ་ནི་མྱུར་དུ་འདིར།
en: And whose eyes are beautiful,

source: །ཆུང་མ་དང་བཅས་དགུག་པར་གྱིས།
en: Together with his wife, quickly!’

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་བྱས་ནས་རང་གི་གནས་སུ་སོང་ངོ་།
en: “Then Śakra, Lord of the Gods, bowed to the bodhisattva and departed for his residence.

source: །ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཐམས་ཅད་བཤེས་གཉེན་ཤི་བ་དང་། བྲམ་ཟེ་དང་། བློན་པོ་དང་། གྲོང་མི་དང་། ཡུལ་མི་རྣམས་ལྷན་ཅིག་ཏུ་བསྟི་གནས་དེར་སོང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་གསོལ་བ་བཏབ་སྟེ་རང་གི་གྲོང་ཁྱེར་དུ་བོས་ནས་རྒྱལ་པོར་བཅུག་གོ།
en: Sometime after, King Viśvāmitra died. Brahmins, ministers, citizens, and provincial dwellers went to the hermitage together, requested the bodhisattva to return to his own city, and enthroned him.

source: །དེ་ནས་རྒྱལ་པོ་ཐམས་ཅད་སྒྲོལ་ཐམས་ཅད་གཏོང་ཞེས་བྱ་བར་གྱུར་ཏོ། །དེས་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བཀྲེན་པ་དང་། ཕོངས་པ་དང་། མཛའ་བོ་དང་། ཉེ་དུ་དང་། གཉེན་བཤེས་དང་། ཞོ་ཤས་འཚོ་བ་རྣམས་ལ་སྦྱིན་པ་རྣམ་པ་དུ་མ་དག་བྱིན་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Thereafter Viśvantara as a king was called Sarvaṃdada, ‘Giver of Everything.’ After having given various donations to śramaṇas, brahmins, the poor, the destitute, friends, kinsmen, relatives, and laborers, he spoke these verses:

source: བྱང་ཆུབ་དོན་དུ་གཉེར་བ་ཡིས། །རྒྱལ་རིགས་བྲམ་ཟེ་རྗེའུ་རིགས་དང་། །དམངས་རིགས་གདོལ་པ་གཡུང་པོ་ལའང་།
en: “ ‘One who seeks awakening and merit

source: །གསེར་དང་དངུལ་དང་བ་ལང་དང་། །རྟ་དང་ནོར་བུའི་རྣ་རྒྱན་དང་། །དེ་བཞིན་ལས་དག་བྱེད་པའི་བྲན།
en: Śūdras, caṇḍālas, and pukkasas. “ ‘He gives gold, silver, oxen, Horses, various jeweled ornaments, And slaves to do various tasks

source: །ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་ལ་སྦྱིན།
en: To those of completely good conduct. “ ‘By giving his son and daughter

source: །ཆགས་པ་མེད་པའི་སེམས་ཀྱིས་ནི། །བུ་དང་བུ་མོ་ཡོངས་བཏང་བས།
en: With a mind free from attachment,

source: །འཇིག་རྟེན་འདི་དང་ཕ་རོལ་ཏུ། །མི་ཡིས་དག་པ་ཐོབ་པར་འགྱུར།
en: A man will attain purity In this world and the next.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ཀྱི་རྒྱལ་པོ་ཐམས་ཅད་སྒྲོལ་ཞེས་བྱ་བར་གྱུར་པ་གང་གིས་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བཀྲེན་པ་དང་། ཕོངས་པ་དང་། མཛའ་བོ་དང་། ཉེ་དུ་དང་། གཉེན་བཤེས་དང་། ཞོ་ཤས་འཚོ་བ་རྣམས་ལ་སྦྱིན་པ་རྣམ་པ་དུ་མ་དག་བྱིན་ནས་བསོད་ནམས་དག་བྱས་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was King Viśvantara, who gave various donations to śramaṇas, brahmins, the poor, the destitute, friends, kinsmen, relatives, and laborers, and thereby made merit, at that time, on that occasion, was someone else, you should think otherwise.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཐམས་ཅད་སྒྲོལ་ཞེས་བྱ་བ་དེར་གྱུར་ཏེ། ང་ཉིད་ཀྱིས་དེ་ན་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བཀྲེན་པ་དང་། ཕོངས་པ་དང་། མཛའ་བོ་དང་། ཉེ་དུ་དང་། གཉེན་བཤེས་དང་། ཞོ་ཤས་འཚོ་བ་རྣམས་ལ་སྦྱིན་པ་རྣམ་པ་དུ་མ་དག་བྱིན། བསོད་ནམས་དག་བྱས་སོ།
en: I was that king named Viśvantara at that time, on that occasion, and there I gave various donations to śramaṇas, brahmins, the poor, the destitute, friends, kinsmen, relatives, and laborers, and thereby made merit.

source: །རྒྱལ་པོ་ཆེན་པོ་ངའི་སྦྱིན་པའམ་སྦྱིན་པའི་བགོ་བཤའ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening by these donations or distributions of donations of mine, you should think otherwise;

source: བསོད་ནམས་དག་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་ཐམས་ཅད་ཅེས་བྱའི་གྲོང་རྡལ་གྱི་གྲོང་ཁྱེར་དུ་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་བཤེས་གཉེན་ཞེས་བྱ་བ་ཞིག་བྱུང་བར་གྱུར་ཏེ། དེ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ།
en: “Great King, once there was a king named Viśvāmitra in a city called Viśvapurī.

source: སྐྱེ་བོ་དང་མི་མང་པོས་རབ་ཏུ་གང་བ། འཐབ་པ་དང་། ཐབ་མོ་དང་། ཁྲག་ཁྲུག་དང་། འགྱེད་པ་དང་། ཆོམ་རྐུན་དང་། ནད་རབ་ཏུ་ཞི་བ། འབྲས་སཱ་ལུ་དང་། བུ་རམ་ཤིང་དང་། བ་ལང་ཕུན་སུམ་ཚོགས་པ། བུ་གཅིག་པ་ལ་བྱམས་པ་བཞིན་དུ་རྒྱལ་སྲིད་བྱེད་དུ་བཅུག་སྟེ། ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ།
en: Just as he loved his only son, he ruled in accordance with the Dharma over his country, which was rich, prosperous, peaceful, abundant in food, and full of many people, where there was no fighting, combat, dispute, strife, robbers, or illness, and which was abundant in rice, sugarcane, and cattle.

source: །དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ནས་དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དེ། དེ་རྩེ་བར་བྱེད། དགའ་བར་བྱེད།
en: “He took a wife from a family of equal rank, and he and she played, made love, and enjoyed themselves.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་ཁྱེའུ་གཟུགས་བཟང་བ་མཛེས་པ། བལྟ་ན་སྡུག་པ། པགས་པའི་མདོག་གསེར་འདྲ་བ། མགོ་གདུགས་ལྟར་འདུག་པ། དཔུང་པ་རིང་བ།
en: Thus, a son was born who was well proportioned, attractive, pleasant to behold, gold in complexion, with a head like a parasol, long arms, and a broad forehead.

source: འཕྲལ་བའི་དབྱེས་ཆེ་བ་ཞིག་བཙས་ཏེ། དེའི་ཉེ་དུ་རྣམས་འདུས་ནས་ཁྱེའུའི་མིང་ཅིར་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དོ། །ཤེས་ལྡན་དག་གཞོན་ནུ་འདི་ནི་རྒྱལ་པོ་ཐམས་ཅད་བཤེས་གཉེན་གྱི་བུ་ཡིན་པས་གཞོན་ནུ་ཐམས་ཅད་སྒྲོལ་ཞེས་བྱ་བར་གདགས་སོ། །ཞེས་གཞོན་ནུ་ཐམས་ཅད་སྒྲོལ་དུ་མིང་བཏགས་ནས།
en: His kinsmen met together and said, ‘What name shall we give the boy?’ Then they said, ‘Sirs, since this prince is the son of King Viśvāmitra, let us name him Prince Viśvantara.’ And so they named the prince Viśvantara.

source: མ་མ་བརྒྱད་ལ་གཏད་དེ་ཞེས་བྱ་བ་ནས།
en: He was entrusted to eight nurses . . . .

source: གནས་ལྔ་རྣམས་ལ་བྱང་བར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: He became fully learned in the five arts . . . .

source: །དེ་གང་ཅི་སློང་བ་དེ་ཐམས་ཅད་སློང་བ་པོ་དག་ལ་སྦྱིན་པར་བྱེད་པས་དེའི་མིང་ཐམས་ཅད་གཏོང་བ་ཐམས་ཅད་གཏོང་བ་ཞེས་བྱ་བར་གྲགས་སོ།
en: “Since he gave everything that was begged for to those who begged, he was known as Sarvaṃdada, ‘Giver of Everything.’

source: །ཁམས་ཀྱི་རྒྱལ་ཕྲན་གྱི་བུ་མོ་རྒྱགས་སྦྱིན་མ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེ་དེའི་ཆེད་དུ་བསླངས་ནས་དཔལ་གྱི་འབྱོར་པ་ཆེན་པོས་བག་མར་བླངས་ཏེ།
en: “There was a daughter of a neighboring minor king called Mādrī. She was asked for and taken to him as a bride together with a vast amount of treasure.

source: དེ་དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད།
en: He and she played, made love, and enjoyed themselves.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་ཇི་ཙམ་ན་ཁྱེའུ་ཞིག་བཙས་པ་དང་། དེའི་མིང་ནག་པོ་ཞེས་བྱ་བར་བཏགས་སོ།
en: Later, a son was born, and he was named Kṛṣṇa.

source: །ཡང་དེ་དང་རྩེ་བར་བྱེད། དགའ་བར་བྱེད།
en: Again they played, made love, and enjoyed themselves.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་བུ་མོ་ཞིག་བཙས་ཏེ། དེའི་མིང་དྲ་བ་ཅན་ཞེས་བྱ་བར་བཏགས་སོ།
en: Thus, a daughter was born, and she was named Jālinī.

source: །རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་བཤེས་གཉེན་ལ་གླང་པོའི་མཆོག་བཀྲ་ཤིས་ལྡན་ཞེས་བྱ་བ་ཡོད་དེ། དེའི་མཐུས་ཁམས་ཀྱི་རྒྱལ་ཕྲན་རྣམས་སྤ་འགོང་བར་བྱེད་དོ། །དེས་ཐམས་ཅད་སྒྲོལ་ལ་སྨྲས་པ།
en: “King Viśvāmitra had a most excellent elephant, called Auspicious, and neighboring minor kings were jealous of him for its power. He said to Viśvantara, ‘Son, it is all because of this most excellent elephant that the neighboring minor kings envy us.

source: བུ་བདག་ཅག་གིས་གང་ཅུང་ཟད་ཁམས་ཀྱི་རྒྱལ་ཕྲན་རྣམས་སྤ་འགོང་བར་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གླང་པོའི་མཆོག་འདིའི་མཐུ་ཡིན་གྱིས་ཁྱོད་ཐམས་ཅད་གཏོང་ན་ཡང་གླང་པོའི་མཆོག་བཀྲ་ཤིས་ལྡན་ནི་ཞོག་ཤིག །ཁམས་ཀྱི་རྒྱལ་ཕྲན་རྣམས་ཀྱིས་སྨྲས་པ།
en: Even if you give everything else, keep the most excellent elephant Auspicious.’

source: གང་གི་མཐུས་ན་བདག་ཅག་ཐམས་ཅད་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་བཤེས་གཉེན་འདིས་ཟིལ་གྱིས་མནན། ཁ་ཅིག་གིས་སྨྲས་པ།
en: “The neighboring minor kings asked each other, ‘Through whose power are we all defeated by this King Viśvāmitra?’

source: རྒྱལ་པོ་ཐམས་ཅད་བཤེས་གཉེན་ལ་གླང་པོའི་མཆོག་བཀྲ་ཤིས་ལྡན་ཞེས་བྱ་བ་ཞིག་ཡོད་དོ།
en: “One of them said, ‘King Viśvāmitra has the best elephant, called Auspicious.

source: །དེའི་མཐུས་བདག་ཅག་འདིས་ཟིལ་གྱིས་མནན་ཏོ། །དེ་དག་གིས་སྨྲས་པ།
en: Through its power we are all defeated by him.’

source: གང་གིས་ན་གླང་པོའི་མཆོག་དེ་དགུག་པའི་ཐབས་བཟང་པོ་ལྟ་ཅི་ཡོད། བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “The rest wondered, ‘Is there any good means whereby we could acquire this most excellent elephant?’

source: ལྷ་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་བཤེས་གཉེན་གྱི་བུ་ཐམས་ཅད་སྒྲོལ་ཞེས་བགྱི་བ་དེ་མི་སྦྱིན་པའམ་མི་གཏོང་བ་ཅི་ཡང་མ་མཆིས་ཏེ།
en: “ ‘Your Majesties,’ said the ministers, ‘the son of King Viśvāmitra, named Viśvantara, gives and bestows everything, without exception.

source: དེ་ཅི་སློང་བ་དེ་ཐམས་ཅད་སྦྱིན་པས་དེའི་མིང་ཐམས་ཅད་གཏོང་བ་ཐམས་ཅད་གཏོང་བ་ཞེས་བྱ་བར་གྲགས་ཀྱིས།
en: Because he gives everything that is begged for, he is known as Sarvaṃdada.

source: བྲམ་ཟེ་དག་ཅིག་མངགས་དང་དེ་རྣམས་ཀྱིས་བསླངས་ན་ཁུགས་པར་འགྱུར་རོ།
en: So, if you send some brahmins and they beg him, you will obtain the elephant.’

source: །དེ་རྣམས་ཀྱིས་བྲམ་ཟེ་དག་བཀུག་ནས་སྨྲས་པ། བྲམ་ཟེ་དག་དེང་ལ་ཐམས་ཅད་ཅེས་བྱ་བའི་གྲོང་རྡལ་ན།
en: “They summoned some brahmins and ordered them, ‘O brahmins, go and beg someone called Viśvantara for the most excellent elephant in Viśvapurī.’

source: ཐམས་ཅད་སྒྲོལ་ཞེས་བྱ་བ་ལས་གླང་པོའི་མཆོག་སློངས་ཤིག །དེ་དག་མངགས་ནས་ཐམས་ཅད་ཀྱི་གྲོང་རྡལ་དུ་དོང་ངོ་།
en: “They were then dispatched and proceeded to Viśvapurī.

source: །གཞོན་ནུ་ཐམས་ཅད་སྒྲོལ་གླང་པོའི་མཆོག་མེ་ཏོག་ཀུན་ད་དང་། ཀུ་མུ་ད་དང་། ཁ་བ་དང་། དངུལ་དང་། སྤྲིན་དཀར་པོའི་མདོག་ལྟ་བུ་མཆེ་བ་དྲུག་པ། བདུན་ལེགས་པར་གནས་པ། གླང་པོ་ཆེ་ས་སྲུང་གི་བུ་ལྟར་འགྱིང་ཞིང་འགྲོ་བ། རང་བཞིན་གྱི་མཚན་མཆོག་གིས་བརྒྱན་པ།
en: “Prince Viśvantara mounted the most excellent elephant, whose color was white like the flowers of jasmine and white water lily, snow, silver, and white clouds, who was possessed of six kinds of greatness, whose body was well supported in its seven parts, whose feet were well supported, and who walked majestically like the elephant Airāvaṇa, was adorned with the best characteristics, and was auspicious to behold.

source: མཐོང་ན་བཀྲ་ཤིས་པ་ལ་ཞོན་ནས་ཤིན་ཏུ་སྡུག་པའི་བྲན་དང་། གྲོགས་པོ་དང་གཡོག་རྣམས་ཕྱི་བཞིན་འབྲང་ཞིང་ཟླ་བ་རྒྱུ་སྐར་གྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་བཞིན་དུ་གྲོང་ཁྱེར་ནས་བྱུང་ནས་སྐྱེད་མོས་ཚལ་ལོགས་སུ་སོང་ངོ་།
en: He left the city and went to a park, followed by his favorite slaves, friends, and servants like the moon surrounded by stars.

source: །དེ་ནས་མངགས་པ་དེ་དག་གིས་གཞོན་ནུ་ཐམས་ཅད་སྒྲོལ་མངོན་དུ་བསུ་ནས་སྨྲས་པ།
en: “Those messengers went to see Prince Viśvantara and first greeted him:

source: །ཁྱོད་ཀྱིས་གླང་པོ་མཆོག་འདི་ནི། །བདག་ཅག་རྣམས་ལ་སྩལ་བའི་རིགས།
en: To give this most excellent elephant to us.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གླང་པོའི་མཆོག་དེ་ལས་བབས་ནས་དགའ་བ་དང་། མགུ་བ་དང་། རབ་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་བྲམ་ཟེ་དེ་དག་ལ་གླང་པོའི་མཆོག་དེ་བསྟན་ནས་སྨྲས་པ།
en: “Having been spoken to this way, the bodhisattva dismounted from the most excellent elephant. With his mind pleased, delighted, and gladdened, he showed the most excellent elephant to the brahmins and said:

source: ཇི་ལྟར་བདག་རབ་དགའ་བས་དེང་། །བྲམ་ཟེ་རྣམས་ལ་གླང་ཆེན་བཏང་།
en: “ ‘Just as I give this most excellent elephant to brahmins With great pleasure today,

source: །བཏང་ནས་བྱང་ཆུབ་མཆོག་རེག་ཤོག །བློན་པོ་རྣམས་ཀྱིས་རྒྱལ་པོ་ཐམས་ཅད་བཤེས་གཉེན་ལ་སྨྲས་པ།
en: And attain supreme awakening.’

source: ལྷ་ཁྱོད་ཀྱི་སྲས་ཐམས་ཅད་སྒྲོལ་གྱིས་གླང་པོའི་མཆོག་བཀྲ་ཤིས་ལྡན་ཞེས་བགྱི་བ་ཕྱིར་རྒོལ་བས་མངགས་པ་ལ་སྩལ་ཏོ།
en: “ ‘The ministers reported to King Viśvāmitra, ‘Your Majesty, your son Viśvantara gave the most excellent elephant named Auspicious to those sent by our enemies.’

source: །རྒྱལ་པོས་ཐོས་ནས་ཤིན་ཏུ་ཁྲོས་འཁྲུགས་ཏེ་བསྒོ་བ། ཤེས་ལྡན་དག་དེང་ལ་ཐམས་ཅད་སྒྲོལ་ཁྲིད་དེ་ཤོག་ཤིག །དེ་རྣམས་ཀྱིས་དེ་ཁྲིད་དེ་འོངས་པ་དང་། རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་བཤེས་གཉེན་གྱིས་ཐམས་ཅད་སྒྲོལ་ལ་སྨྲས་པ།
en: “When he was told this, the king trembled with intense anger and ordered them, ‘Sirs, bring Viśvantara today.’

source: གཞོན་ནུ་ཁོ་བོས་ཁྱོད་ལ་གང་ཅུང་ཟད་ཁམས་ཀྱི་རྒྱལ་ཕྲན་རྣམས་སྤ་འགོང་བར་བྱེད་པ་དེ་ཐམས་ཅད་ནི་གླང་པོའི་མཆོག་འདིའི་མཐུ་ཡིན་གྱིས།
en: “They brought him, and King Viśvāmitra said to Viśvantara, ‘Son, did I not once instruct you, “The only thing the neighboring minor kings are jealous of us for is this most excellent elephant’s power.

source: ཁྱོད་ཐམས་ཅད་གཏོང་ན་ཡང་གླང་པོའི་མཆོག་འདི་ནི་ཞོག་ཤིག །ཅེས་སྔ་མོ་ཞིག་ཏུ་མ་བསྒོའམ།
en: So, even if you give away everything else, keep this most excellent elephant”?

source: ཅིའི་ཕྱིར་ཁྱོད་ཀྱིས་གླང་པོའི་མཆོག་ཡོངས་སུ་བཏང་།
en: Why did you give away the most excellent elephant?’

source: དེས་མཉན་ནས་སྨྲས་པ། ཡབ་བསླངས་ན་ཇི་ལྟར་མི་སྩལ།
en: “ ‘Father,’ he replied, ‘how could I refuse when I was begged?’

source: ཅི་ཇི་སྙེད་བསླངས་པ་དེ་ཐམས་ཅད་སྦྱིན་ནམ།
en: “ ‘Why do you give everything begged for?’

source: ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “He answered with a verse:

source: ཁྱིམ་ན་གནས་པའི་སྐྱེས་བུ་ཡིས།
en: “ ‘A man dwelling at home

source: །ཅི་རིགས་པར་ནི་སྦྱིན་པ་གཏང་།
en: Gives donations in a proper manner.

source: །འོན་ཏེ་ནགས་སུ་སོང་ན་ནི།
en: But if he goes to the forest,

source: །ངེས་པ་ཡི་ནི་མཆོག་བྱའོ།
en: He should perform the best self-restraint.

source: །ཡབ་གལ་ཏེ་སྦྱིན་པ་དག་བཏང་། བསོད་ནམས་དག་བགྱིར་མ་མཆིས་ན་དཀའ་ཐུབ་ཀྱི་ནགས་སུ་བརྟེན་པར་བགྱིའོ།
en: “ ‘Father, if I cannot give donations or make merit, I will dwell in the forest of ascetics.’

source: །གཞོན་ནུ་དེ་བཞིན་དུ་གྱིས་ཤིག །བྱང་ཆུབ་སེམས་དཔས་རྒྱགས་སྦྱིན་མའི་དྲུང་དུ་སོང་སྟེ་སྨྲས་པ། རྒྱགས་སྦྱིན་མ་བདག་ནི་དཀའ་ཐུབ་ཀྱི་ནགས་སུ་གནས་ཀྱིས།
en: “ ‘Son, you should do so.’ “The bodhisattva went to Mādrī and said, ‘Mādrī, I am going to live in the forest of ascetics;

source: ཁྱོད་ཁྱིམ་ན་བག་ཡོད་པར་གནོས་ཤིག །དེས་སྨྲས་པ།
en: you should live carefully at home.’

source: རྗེའི་སྲས་དང་ཐབས་ཅིག་དཀའ་ཐུབ་ཀྱི་ནགས་སུ་གནས་པར་བགྱིའོ།
en: “ ‘I will live with my master in the forest of ascetics too,’ she replied.

source: །རྒྱགས་སྦྱིན་མ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྦྱིན་པ་ལ་དགའ་བས་གལ་ཏེ་ཁྱོད་འགའ་ཞིག་སློང་ན་བྱིན་པར་འགྱུར་རོ།
en: “ ‘Mādrī, since bodhisattvas are pleased with giving, if someone begs for you, I will give you away.’

source: །རྗེའི་སྲས་གལ་ཏེ་ཁྱོད་ཀྱིས་བཏང་ན་སྩལ་དུ་གསོལ།
en: “ ‘My dear, if you have to give me away, please do so.’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ཁྱོད་ཀྱིས་དམ་བཅས་པ་འདི་དྲན་པར་བྱོས་ཤིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཕའི་དྲུང་དུ་སོང་ནས་མགོ་བོས་ཕྱག་བྱས་ཏེ་སྨྲས་པ།
en: “ ‘Remember what you promised,’ cautioned the bodhisattva. “Thereupon the bodhisattva went to his father, bowed to him, and said:

source: ཡབ་གཅིག་བདག་གིས་སྦྱིན་སླད་གླང་ཆེན་བཏང་། །ནོངས་པ་གང་ལགས་ས་བདག་བཟོད་པར་གསོལ།
en: “ ‘Father, master of the earth, please forgive me for my fault, Which was my giving that most excellent elephant as a donation.

source: །བདག་ནི་གྲོང་ནས་དགོན་པར་མཆིས་ལགས་ཀྱིས།
en: I will leave the city and go to the wilderness.

source: །མི་དབང་ཁྱོད་ཀྱི་ཕྱག་མཛོད་སྟོངས་མ་གྱུར།
en: Your storehouse, O master of the people, will not become empty.’

source: །དེ་ནས་རྒྱལ་པོ་བུ་དང་བྲལ་བའི་བློང་བས་མཆི་མས་བརྣངས་ནས་སྨྲས་པ།
en: “Then the king, distracted by the separation from his son and choking with tears, said, ‘Son, withdraw your determination to give donations and go to the forest of ascetics.’

source: བུ་སྦྱིན་པ་དང་དཀའ་ཐུབ་ཀྱི་ནགས་ཀྱི་བློ་གྲོས་འདི་ཟློག་ཤིག །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ།
en: “The bodhisattva replied:

source: ས་ནི་རི་དང་བཅས་པར་ཡང་། །གལ་ཏེ་ལྡོག་པར་འགྱུར་གདའ་ཡི།
en: “ ‘Even if the earth together with the mountains Turned back,

source: །ཞེས་སྨྲས་ནས་སོང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་བུ་དང་བུ་མོ་དང་། ཆུང་མ་དང་ལྷན་ཅིག་ཤིང་རྟ་མཆོག་གི་ནང་དུ་ཞུགས་ནས་དཀའ་ཐུབ་ཀྱི་ནགས་སུ་ཆས་སོ།
en: “The bodhisattva then departed, mounting the most excellent chariot with his son, daughter, and wife, and went to the forest of ascetics.

source: །དེ་ནས་བྲམ་ཟེ་རིག་བྱེད་དང་རིག་བྱེད་ཀྱི་ཡན་ལག་ཤེས་པ་ཁ་ཅིག་གིས་ཐམས་ཅད་སྒྲོལ་བསུ་ནས་སྨྲས་པ།
en: “Then certain brahmins who had mastered the Vedas and the auxiliary branches of the Vedas met Viśvantara and said, ‘O kṣatriya prince, victory to you!

source: རྒྱལ་རིགས་གཞོན་ནུ་ཁྱོད་རྒྱལ་བར་གྱུར་ཅིག །ཁྱོད་ནི་འཇིག་རྟེན་ཐམས་ཅད་དུ།
en: “ ‘All over the world, you are

source: །བྲམ་ཟེ་དག་ལ་ཤིང་རྟ་འདི། །ཁྱོད་ཀྱིས་སྦྱིན་པར་གཏང་བའི་རིགས།
en: To give this chariot to brahmins as a donation.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྒྲོལ་ཤིང་རྟའི་མཆོག་དེ་ལས་བབས་ནས་དགའ་བ་དང་། མགུ་བ་དང་། རབ་ཏུ་དགའ་བའི་སྙིང་གིས་བྲམ་ཟེ་དེ་དག་ལ་ཤིང་རྟའི་མཆོག་དེ་བསྟན་ནས་སྨྲས་པ།
en: “Having been thus requested, the bodhisattva dismounted from that most excellent chariot. With his heart pleased, delighted, and gladdened, he showed the most excellent chariot to the brahmins and said:

source: ཇི་ལྟར་བདག་རབ་དགའ་བས་དེང་། །བྲམ་ཟེ་རྣམས་ལ་ཤིང་རྟ་བཏང་།
en: “ ‘Just as I give this chariot to brahmins With great pleasure today,

source: །བཏང་ནས་བྱང་ཆུབ་མཆོག་རེག་ཤོག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྟ་ལ་ཞོན་ནས་རྒྱགས་སྦྱིན་མ་དང་ལྷན་ཅིག་དོང་བ་དང་། དེ་ནས་བྲམ་ཟེ་རིག་བྱེད་དང་རིག་བྱེད་ཀྱི་ཡན་ལག་ཤེས་པ་ཁ་ཅིག་གིས་ཐམས་ཅད་སྒྲོལ་བསུ་ནས་སྨྲས་པ།
en: And attain supreme awakening.’ “Thereupon the bodhisattva mounted a horse and proceeded with Mādrī. Then certain brahmins who had mastered the Vedas and the auxiliary branches of the Vedas met Viśvantara and said, ‘O kṣatriya prince, victory to you!

source: །བྲམ་ཟེ་རྣམས་ལ་རྟ་འདི་ནི། །ཁྱོད་ཀྱིས་སྦྱིན་པར་གཏང་བའི་རིགས།
en: To give this horse to brahmins as a donation.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྒྲོལ་རྟ་དེ་ལས་བབས་ནས་དགའ་བ་དང་། མགུ་བ་དང་། རབ་ཏུ་དགའ་བའི་སྙིང་གིས་བྲམ་ཟེ་དེ་རྣམས་ལ་རྟ་དེ་བསྟན་ནས་སྨྲས་པ།
en: “Having this said to him, the bodhisattva dismounted from the horse. With his heart pleased, delighted, and gladdened, he showed the horse to these brahmins and said:

source: ཇི་ལྟར་བདག་རབ་དགའ་བས་དེང་། །བྲམ་ཟེ་རྣམས་ལ་རྟ་བཏང་བ།
en: “ ‘Just as I give the horse to brahmins With great pleasure today,

source: །བཏང་ནས་བྱང་ཆུབ་མཆོག་རེག་ཤོག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ནི་ནག་པོ་ཁྲིད།
en: And attain supreme awakening.’ “Thereupon the bodhisattva went on foot, leading Kṛṣṇa, with Mādrī leading Jālinī.

source: རྒྱགས་སྦྱིན་མས་ནི་དྲ་བ་ཅན་ཁྲིད་དེ་རྐང་པས་དོང་ནས་བྱང་ཆུབ་སེམས་དཔས་གངས་རིའི་སུལ་མེ་ཏོག་དང་། འབྲས་བུ་དང་། ཆུ་ཕུན་སུམ་ཚོགས་པ་ཞིག་ཏུ་སོང་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་ནི་བསམ་གཏན་བྱེད་དོ།
en: The bodhisattva went to a valley on Mount Kailāsa that was abundant in flowers, fruits, and water. The bodhisattva practiced dhyāna.

source: །རྒྱགས་སྦྱིན་མ་ནི་འབྲས་བུས་བསྙེན་བཀུར་བྱེད་དོ།
en: Mādrī served him with fruits.

source: །རི་འོར་གཞན་ཞིག་ན་བྲམ་ཟེ་ཞིག་གནས་པ་དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ཏེ།
en: “There lived a brahmin in a certain hamlet.

source: དེ་དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དེ། དེ་རྩེ་བར་བྱེད། དགའ་བར་བྱེད།
en: He took a wife from a family of equal rank, and he and his wife played, made love, and enjoyed themselves.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་ཁྱེའུ་མཚན་ངན་པ་བཅྭ་བརྒྱད་དང་ལྡན་པ་ཞིག་བཙས་པ་ངན་ཏོ་རེ་ཞེས་སྒྲ་འབྱིན་པས་དེའི་མིང་ངན་ཏོ་རེ་ངན་ཏོ་རེ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Thus, a son who had eighteen inauspicious marks was born.

source: །རི་འོར་གཞན་ཞིག་ན་བྲམ་ཟེ་རིག་བྱེད་བཞི་ཤེས་པ་ཞིག་གནས་པ་དེས་རིག་མཉམ་པ་ལས་ཆུང་མ་བླངས་ཏེ།
en: He uttered the cry ‘Jujjuka!’ whereupon he was named Jujjuka. There lived in another hamlet a brahmin who knew the four Vedas.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་ཇི་ཙམ་ན་བུ་མོ་གཟུགས་བཟང་མོ། མཛེས་མ།
en: Thus, a daughter was born, who was well proportioned, attractive, and pleasant to behold.

source: བལྟ་ན་སྡུག་པ་ཞིག་བཙས་ཏེ་བསྲིངས་བསྐྱེད་ནས་ཆེན་མོར་གྱུར་པ་དང་། བྲམ་ཟེ་དེས་བདག་གི་བུ་མོ་འདི་བྱད་གཟུགས་སམ།
en: When she had been raised and had grown up, the brahmin made a vow:

source: རིགས་སམ། བཟོའམ། ནོར་གྱི་ཕྱིར་ནི་སུ་ལ་ཡང་མི་སྦྱིན་ནོ།
en: ‘I will not give this daughter of mine to anyone for his looks, family, work, or wealth.

source: །འོན་ཀྱང་སུ་ཞིག་བདག་ལས་རིག་བྱེད་བཞི་ཀློག་པ་ཞིག་ཡོད་ན། བདག་གིས་དེ་ལ་འདི་སྦྱིན་པར་བྱའོ་ཞེས་དམ་བཅས་སོ།
en: But if someone learns the four Vedas from me, I shall give her to him.’

source: །དེ་ནས་ངན་ཏོ་རེ་གསང་ཚིག་དོན་དུ་གཉེར་ཞིང་གསང་ཚིག་ཚོལ་བ་བྲམ་ཟེ་དེའི་གན་དུ་སོང་སྟེ་ཕྱིན་པ་དང་སྨྲས་པ།
en: “Then Jujjuka went to the brahmin, seeking mantras, looking for mantras.

source: མཁན་པོའི་ཞབས་ལ་བཀུར་སྟི་བགྱིད་པར་འཚལ་ལགས་སོ།
en: Upon his arrival, he said, ‘I make a request of you, paying homage at the master’s feet.’
